#### `terraform plan` Success

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # google_container_cluster.gcp_kubernetes will be created
+ resource "google_container_cluster" "gcp_kubernetes" {
      + additional_zones            = (known after apply)
      + cluster_autoscaling         = (known after apply)
      + cluster_ipv4_cidr           = (known after apply)
      + enable_binary_authorization = (known after apply)
      + enable_kubernetes_alpha     = false
      + enable_legacy_abac          = false
      + enable_tpu                  = (known after apply)
      + endpoint                    = (known after apply)
      + id                          = (known after apply)
      + initial_node_count          = 10
      + instance_group_urls         = (known after apply)
      + ip_allocation_policy        = (known after apply)
      + location                    = "us-east1-c"
      + logging_service             = (known after apply)
      + master_version              = (known after apply)
      + monitoring_service          = (known after apply)
      + name                        = "elastic-search-cluster"
      + network                     = "default"
      + node_locations              = (known after apply)
      + node_version                = (known after apply)
      + project                     = (known after apply)
      + region                      = (known after apply)
      + services_ipv4_cidr          = (known after apply)
      + subnetwork                  = (known after apply)
      + zone                        = (known after apply)

      + addons_config {
          + horizontal_pod_autoscaling {
              + disabled = (known after apply)
            }

          + http_load_balancing {
              + disabled = (known after apply)
            }

          + kubernetes_dashboard {
              + disabled = (known after apply)
            }

          + network_policy_config {
              + disabled = (known after apply)
            }
        }

      + master_auth {
          + client_certificate     = (known after apply)
          + client_key             = (sensitive value)
          + cluster_ca_certificate = (known after apply)
          + password               = (sensitive value)
          + username               = "chitrung"

          + client_certificate_config {
              + issue_client_certificate = (known after apply)
            }
        }

      + network_policy {
          + enabled  = (known after apply)
          + provider = (known after apply)
        }

      + node_config {
          + disk_size_gb      = (known after apply)
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = {
              + "env" = "dev-cluster"
            }
          + local_ssd_count   = (known after apply)
          + machine_type      = "n1-standard-2"
          + metadata          = (known after apply)
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/compute",
              + "https://www.googleapis.com/auth/logging.write",
              + "https://www.googleapis.com/auth/monitoring",
            ]
          + preemptible       = false
          + service_account   = (known after apply)
          + tags              = [
              + "dev",
              + "demo",
            ]
        }

      + node_pool {
          + initial_node_count  = (known after apply)
          + instance_group_urls = (known after apply)
          + max_pods_per_node   = (known after apply)
          + name                = (known after apply)
          + name_prefix         = (known after apply)
          + node_count          = (known after apply)
          + version             = (known after apply)

          + autoscaling {
              + max_node_count = (known after apply)
              + min_node_count = (known after apply)
            }

          + management {
              + auto_repair  = (known after apply)
              + auto_upgrade = (known after apply)
            }

          + node_config {
              + disk_size_gb      = (known after apply)
              + disk_type         = (known after apply)
              + guest_accelerator = (known after apply)
              + image_type        = (known after apply)
              + labels            = (known after apply)
              + local_ssd_count   = (known after apply)
              + machine_type      = (known after apply)
              + metadata          = (known after apply)
              + min_cpu_platform  = (known after apply)
              + oauth_scopes      = (known after apply)
              + preemptible       = (known after apply)
              + service_account   = (known after apply)
              + tags              = (known after apply)

              + sandbox_config {
                  + sandbox_type = (known after apply)
                }

              + taint {
                  + effect = (known after apply)
                  + key    = (known after apply)
                  + value  = (known after apply)
                }

              + workload_metadata_config {
                  + node_metadata = (known after apply)
                }
            }
        }
    }

  # kubernetes_cluster_role.cluster_role will be created
+ resource "kubernetes_cluster_role" "cluster_role" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "fluentd"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + rule {
          + api_groups = [
              + "",
            ]
          + resources  = [
              + "namespaces",
              + "pods",
            ]
          + verbs      = [
              + "get",
              + "list",
              + "watch",
            ]
        }
    }

  # kubernetes_cluster_role_binding.cluster_role_binding will be created
+ resource "kubernetes_cluster_role_binding" "cluster_role_binding" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "fluentd"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "ClusterRole"
          + name      = "fluentd"
        }

      + subject {
          + api_group = (known after apply)
          + kind      = "ServiceAccount"
          + name      = "fluentd"
          + namespace = "default"
        }
    }

  # kubernetes_daemonset.deamon_fluent will be created
+ resource "kubernetes_daemonset" "deamon_fluent" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "k8s-app"                       = "fluentd-logging"
              + "kubernetes.io/cluster-service" = "true"
              + "version"                       = "v1"
            }
          + name             = "fluentd"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + min_ready_seconds      = 0
          + revision_history_limit = 10

          + selector {
              + match_labels = {
                  + "k8s-app"                       = "fluentd-logging"
                  + "kubernetes.io/cluster-service" = "true"
                  + "version"                       = "v1"
                }
            }

          + strategy {
              + type = (known after apply)

              + rolling_update {
                  + max_unavailable = (known after apply)
                }
            }

          + template {
              + metadata {
                  + generation       = (known after apply)
                  + labels           = {
                      + "k8s-app"                       = "fluentd-logging"
                      + "kubernetes.io/cluster-service" = "true"
                      + "version"                       = "v1"
                    }
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + self_link        = (known after apply)
                  + uid              = (known after apply)
                }

              + spec {
                  + automount_service_account_token  = true
                  + dns_policy                       = "ClusterFirst"
                  + host_ipc                         = false
                  + host_network                     = false
                  + host_pid                         = false
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  + restart_policy                   = "Always"
                  + service_account_name             = "fluentd"
                  + share_process_namespace          = false
                  + termination_grace_period_seconds = 30

                  + container {
                      + image                    = "fluent/fluentd-kubernetes-daemonset:v1.3-debian-elasticsearch"
                      + image_pull_policy        = (known after apply)
                      + name                     = "fluentd"
                      + stdin                    = false
                      + stdin_once               = false
                      + termination_message_path = "/dev/termination-log"
                      + tty                      = false

                      + env {
                          + name  = "FLUENT_ELASTICSEARCH_HOST"
                          + value = "es-nodes"
                        }
                      + env {
                          + name  = "FLUENT_ELASTICSEARCH_PORT"
                          + value = "9200"
                        }
                      + env {
                          + name  = "FLUENT_ELASTICSEARCH_SCHEME"
                          + value = "http"
                        }
                      + env {
                          + name  = "FLUENT_UID"
                          + value = "0"
                        }

                      + resources {
                          + limits {
                              + cpu    = (known after apply)
                              + memory = "200Mi"
                            }

                          + requests {
                              + cpu    = "100m"
                              + memory = "200Mi"
                            }
                        }

                      + volume_mount {
                          + mount_path = "/var/log"
                          + name       = "varlog"
                          + read_only  = false
                        }
                      + volume_mount {
                          + mount_path = "/var/lib/docker/containers"
                          + name       = "varlibdockercontainers"
                          + read_only  = true
                        }
                    }

                  + image_pull_secrets {
                      + name = (known after apply)
                    }

                  + toleration {
                      + effect   = "NoSchedule"
                      + key      = "node-role.kubernetes.io/master"
                      + operator = "Equal"
                    }

                  + volume {
                      + name = "varlog"

                      + host_path {
                          + path = "/var/log"
                        }
                    }
                  + volume {
                      + name = "varlibdockercontainers"

                      + host_path {
                          + path = "/var/lib/docker/containers"
                        }
                    }
                }
            }
        }
    }

  # kubernetes_deployment.depl_kube_kibana will be created
+ resource "kubernetes_deployment" "depl_kube_kibana" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "kibana"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + min_ready_seconds         = 0
          + paused                    = false
          + progress_deadline_seconds = 600
          + replicas                  = 1
          + revision_history_limit    = 10

          + selector {
              + match_labels = {
                  + "run" = "kibana"
                }
            }

          + strategy {
              + type = (known after apply)

              + rolling_update {
                  + max_surge       = (known after apply)
                  + max_unavailable = (known after apply)
                }
            }

          + template {
              + metadata {
                  + generation       = (known after apply)
                  + labels           = {
                      + "run" = "kibana"
                    }
                  + name             = (known after apply)
                  + namespace        = "default"
                  + resource_version = (known after apply)
                  + self_link        = (known after apply)
                  + uid              = (known after apply)
                }

              + spec {
                  + dns_policy                       = "ClusterFirst"
                  + host_ipc                         = false
                  + host_network                     = false
                  + host_pid                         = false
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  + restart_policy                   = "Always"
                  + service_account_name             = (known after apply)
                  + share_process_namespace          = false
                  + termination_grace_period_seconds = 30

                  + container {
                      + image                    = "docker.elastic.co/kibana/kibana-oss:6.4.3"
                      + image_pull_policy        = (known after apply)
                      + name                     = "kibana"
                      + stdin                    = false
                      + stdin_once               = false
                      + termination_message_path = "/dev/termination-log"
                      + tty                      = false

                      + env {
                          + name  = "ELASTICSEARCH_URL"
                          + value = "http://es-nodes:9200"
                        }

                      + port {
                          + container_port = 5601
                          + protocol       = "TCP"
                        }

                      + resources {
                          + limits {
                              + cpu    = "1000m"
                              + memory = (known after apply)
                            }

                          + requests {
                              + cpu    = "100m"
                              + memory = (known after apply)
                            }
                        }

                      + volume_mount {
                          + mount_path = (known after apply)
                          + name       = (known after apply)
                          + read_only  = (known after apply)
                          + sub_path   = (known after apply)
                        }
                    }

                  + image_pull_secrets {
                      + name = (known after apply)
                    }

                  + volume {
                      + name = (known after apply)

                      + aws_elastic_block_store {
                          + fs_type   = (known after apply)
                          + partition = (known after apply)
                          + read_only = (known after apply)
                          + volume_id = (known after apply)
                        }

                      + azure_disk {
                          + caching_mode  = (known after apply)
                          + data_disk_uri = (known after apply)
                          + disk_name     = (known after apply)
                          + fs_type       = (known after apply)
                          + read_only     = (known after apply)
                        }

                      + azure_file {
                          + read_only   = (known after apply)
                          + secret_name = (known after apply)
                          + share_name  = (known after apply)
                        }

                      + ceph_fs {
                          + monitors    = (known after apply)
                          + path        = (known after apply)
                          + read_only   = (known after apply)
                          + secret_file = (known after apply)
                          + user        = (known after apply)

                          + secret_ref {
                              + name = (known after apply)
                            }
                        }

                      + cinder {
                          + fs_type   = (known after apply)
                          + read_only = (known after apply)
                          + volume_id = (known after apply)
                        }

                      + config_map {
                          + default_mode = (known after apply)
                          + name         = (known after apply)

                          + items {
                              + key  = (known after apply)
                              + mode = (known after apply)
                              + path = (known after apply)
                            }
                        }

                      + downward_api {
                          + default_mode = (known after apply)

                          + items {
                              + mode = (known after apply)
                              + path = (known after apply)

                              + field_ref {
                                  + api_version = (known after apply)
                                  + field_path  = (known after apply)
                                }

                              + resource_field_ref {
                                  + container_name = (known after apply)
                                  + quantity       = (known after apply)
                                  + resource       = (known after apply)
                                }
                            }
                        }

                      + empty_dir {
                          + medium = (known after apply)
                        }

                      + fc {
                          + fs_type      = (known after apply)
                          + lun          = (known after apply)
                          + read_only    = (known after apply)
                          + target_ww_ns = (known after apply)
                        }

                      + flex_volume {
                          + driver    = (known after apply)
                          + fs_type   = (known after apply)
                          + options   = (known after apply)
                          + read_only = (known after apply)

                          + secret_ref {
                              + name = (known after apply)
                            }
                        }

                      + flocker {
                          + dataset_name = (known after apply)
                          + dataset_uuid = (known after apply)
                        }

                      + gce_persistent_disk {
                          + fs_type   = (known after apply)
                          + partition = (known after apply)
                          + pd_name   = (known after apply)
                          + read_only = (known after apply)
                        }

                      + git_repo {
                          + directory  = (known after apply)
                          + repository = (known after apply)
                          + revision   = (known after apply)
                        }

                      + glusterfs {
                          + endpoints_name = (known after apply)
                          + path           = (known after apply)
                          + read_only      = (known after apply)
                        }

                      + host_path {
                          + path = (known after apply)
                          + type = (known after apply)
                        }

                      + iscsi {
                          + fs_type         = (known after apply)
                          + iqn             = (known after apply)
                          + iscsi_interface = (known after apply)
                          + lun             = (known after apply)
                          + read_only       = (known after apply)
                          + target_portal   = (known after apply)
                        }

                      + local {
                          + path = (known after apply)
                        }

                      + nfs {
                          + path      = (known after apply)
                          + read_only = (known after apply)
                          + server    = (known after apply)
                        }

                      + persistent_volume_claim {
                          + claim_name = (known after apply)
                          + read_only  = (known after apply)
                        }

                      + photon_persistent_disk {
                          + fs_type = (known after apply)
                          + pd_id   = (known after apply)
                        }

                      + quobyte {
                          + group     = (known after apply)
                          + read_only = (known after apply)
                          + registry  = (known after apply)
                          + user      = (known after apply)
                          + volume    = (known after apply)
                        }

                      + rbd {
                          + ceph_monitors = (known after apply)
                          + fs_type       = (known after apply)
                          + keyring       = (known after apply)
                          + rados_user    = (known after apply)
                          + rbd_image     = (known after apply)
                          + rbd_pool      = (known after apply)
                          + read_only     = (known after apply)

                          + secret_ref {
                              + name = (known after apply)
                            }
                        }

                      + secret {
                          + default_mode = (known after apply)
                          + optional     = (known after apply)
                          + secret_name  = (known after apply)

                          + items {
                              + key  = (known after apply)
                              + mode = (known after apply)
                              + path = (known after apply)
                            }
                        }

                      + vsphere_volume {
                          + fs_type     = (known after apply)
                          + volume_path = (known after apply)
                        }
                    }
                }
            }
        }
    }

  # kubernetes_service.svc_kube_elastic_search will be created
+ resource "kubernetes_service" "svc_kube_elastic_search" {
      + id                    = (known after apply)
      + load_balancer_ingress = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "service" = "elasticsearch"
            }
          + name             = "es-nodes"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + cluster_ip                  = (known after apply)
          + external_traffic_policy     = (known after apply)
          + publish_not_ready_addresses = false
          + selector                    = {
              + "service" = "elasticsearch"
            }
          + session_affinity            = "None"
          + type                        = "NodePort"

          + port {
              + name        = "external"
              + node_port   = (known after apply)
              + port        = 9200
              + protocol    = "TCP"
              + target_port = "9200"
            }
          + port {
              + name        = "internal"
              + node_port   = (known after apply)
              + port        = 9300
              + protocol    = "TCP"
              + target_port = "9300"
            }
        }
    }

  # kubernetes_service.svc_kube_kibana will be created
+ resource "kubernetes_service" "svc_kube_kibana" {
      + id                    = (known after apply)
      + load_balancer_ingress = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "service" = "kibana"
            }
          + name             = "kibana"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + cluster_ip                  = (known after apply)
          + external_traffic_policy     = (known after apply)
          + publish_not_ready_addresses = false
          + selector                    = {
              + "run" = "kibana"
            }
          + session_affinity            = "None"
          + type                        = "LoadBalancer"

          + port {
              + node_port   = (known after apply)
              + port        = 8081
              + protocol    = "TCP"
              + target_port = "5601"
            }
        }
    }

  # kubernetes_service_account.svc_account will be created
+ resource "kubernetes_service_account" "svc_account" {
      + default_secret_name = (known after apply)
      + id                  = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "fluentd"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_stateful_set.sfs_kube_elastic_search will be created
+ resource "kubernetes_stateful_set" "sfs_kube_elastic_search" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "service" = "elasticsearch"
            }
          + name             = "elasticsearch"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + pod_management_policy  = (known after apply)
          + replicas               = 2
          + revision_history_limit = (known after apply)
          + service_name           = "es-nodes"

          + selector {
              + match_labels = {
                  + "service" = "elasticsearch"
                }
            }

          + template {
              + metadata {
                  + generation       = (known after apply)
                  + labels           = {
                      + "service" = "elasticsearch"
                    }
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + self_link        = (known after apply)
                  + uid              = (known after apply)
                }

              + spec {
                  + dns_policy                       = "ClusterFirst"
                  + host_ipc                         = false
                  + host_network                     = false
                  + host_pid                         = false
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  + restart_policy                   = "Always"
                  + service_account_name             = (known after apply)
                  + share_process_namespace          = false
                  + termination_grace_period_seconds = 300

                  + container {
                      + image                    = "docker.elastic.co/elasticsearch/elasticsearch:6.4.3"
                      + image_pull_policy        = (known after apply)
                      + name                     = "elasticsearch"
                      + stdin                    = false
                      + stdin_once               = false
                      + termination_message_path = "/dev/termination-log"
                      + tty                      = false

                      + env {
                          + name  = "cluster.name"
                          + value = "elasticsearch-cluster"
                        }
                      + env {
                          + name = "node.name"

                          + value_from {

                              + field_ref {
                                  + api_version = "v1"
                                  + field_path  = "metadata.name"
                                }
                            }
                        }
                      + env {
                          + name  = "discovery.zen.ping.unicast.hosts"
                          + value = "elasticsearch-0.es-nodes.default.svc.cluster.local,elasticsearch-1.es-nodes.default.svc.cluster.local,elasticsearch-2.es-nodes.default.svc.cluster.local"
                        }
                      + env {
                          + name  = "ES_JAVA_OPTS"
                          + value = "-Xms512m -Xmx512m"
                        }

                      + port {
                          + container_port = 9200
                          + name           = "http"
                          + protocol       = "TCP"
                        }
                      + port {
                          + container_port = 9300
                          + name           = "tcp"
                          + protocol       = "TCP"
                        }

                      + resources {
                          + limits {
                              + cpu    = (known after apply)
                              + memory = "1Gi"
                            }

                          + requests {
                              + cpu    = (known after apply)
                              + memory = "400Mi"
                            }
                        }

                      + volume_mount {
                          + mount_path = "/usr/share/elasticsearch/data"
                          + name       = "data"
                          + read_only  = false
                        }
                    }

                  + image_pull_secrets {
                      + name = (known after apply)
                    }

                  + init_container {
                      + command                  = [
                          + "sh",
                          + "-c",
                          + "ulimit",
                          + "-n",
                          + "65536",
                        ]
                      + image                    = "busybox"
                      + image_pull_policy        = (known after apply)
                      + name                     = "ulimit"
                      + stdin                    = false
                      + stdin_once               = false
                      + termination_message_path = "/dev/termination-log"
                      + tty                      = false

                      + resources {
                          + limits {
                              + cpu    = (known after apply)
                              + memory = (known after apply)
                            }

                          + requests {
                              + cpu    = (known after apply)
                              + memory = (known after apply)
                            }
                        }

                      + security_context {
                          + allow_privilege_escalation = true
                          + privileged                 = true
                          + read_only_root_filesystem  = false
                        }

                      + volume_mount {
                          + mount_path = (known after apply)
                          + name       = (known after apply)
                          + read_only  = (known after apply)
                          + sub_path   = (known after apply)
                        }
                    }
                  + init_container {
                      + command                  = [
                          + "sysctl",
                          + "-w",
                          + "vm.max_map_count=262144",
                        ]
                      + image                    = "busybox"
                      + image_pull_policy        = (known after apply)
                      + name                     = "vm-max-map-count"
                      + stdin                    = false
                      + stdin_once               = false
                      + termination_message_path = "/dev/termination-log"
                      + tty                      = false

                      + resources {
                          + limits {
                              + cpu    = (known after apply)
                              + memory = (known after apply)
                            }

                          + requests {
                              + cpu    = (known after apply)
                              + memory = (known after apply)
                            }
                        }

                      + security_context {
                          + allow_privilege_escalation = true
                          + privileged                 = true
                          + read_only_root_filesystem  = false
                        }

                      + volume_mount {
                          + mount_path = (known after apply)
                          + name       = (known after apply)
                          + read_only  = (known after apply)
                          + sub_path   = (known after apply)
                        }
                    }
                  + init_container {
                      + command                  = [
                          + "chown",
                          + "-R",
                          + "1000:1000",
                          + "/usr/share/elasticsearch/data",
                        ]
                      + image                    = "busybox"
                      + image_pull_policy        = (known after apply)
                      + name                     = "volume-permission"
                      + stdin                    = false
                      + stdin_once               = false
                      + termination_message_path = "/dev/termination-log"
                      + tty                      = false

                      + resources {
                          + limits {
                              + cpu    = (known after apply)
                              + memory = (known after apply)
                            }

                          + requests {
                              + cpu    = (known after apply)
                              + memory = (known after apply)
                            }
                        }

                      + security_context {
                          + allow_privilege_escalation = true
                          + privileged                 = true
                          + read_only_root_filesystem  = false
                        }

                      + volume_mount {
                          + mount_path = "/usr/share/elasticsearch/data"
                          + name       = "data"
                          + read_only  = false
                        }
                    }

                  + volume {
                      + name = (known after apply)

                      + aws_elastic_block_store {
                          + fs_type   = (known after apply)
                          + partition = (known after apply)
                          + read_only = (known after apply)
                          + volume_id = (known after apply)
                        }

                      + azure_disk {
                          + caching_mode  = (known after apply)
                          + data_disk_uri = (known after apply)
                          + disk_name     = (known after apply)
                          + fs_type       = (known after apply)
                          + read_only     = (known after apply)
                        }

                      + azure_file {
                          + read_only   = (known after apply)
                          + secret_name = (known after apply)
                          + share_name  = (known after apply)
                        }

                      + ceph_fs {
                          + monitors    = (known after apply)
                          + path        = (known after apply)
                          + read_only   = (known after apply)
                          + secret_file = (known after apply)
                          + user        = (known after apply)

                          + secret_ref {
                              + name = (known after apply)
                            }
                        }

                      + cinder {
                          + fs_type   = (known after apply)
                          + read_only = (known after apply)
                          + volume_id = (known after apply)
                        }

                      + config_map {
                          + default_mode = (known after apply)
                          + name         = (known after apply)

                          + items {
                              + key  = (known after apply)
                              + mode = (known after apply)
                              + path = (known after apply)
                            }
                        }

                      + downward_api {
                          + default_mode = (known after apply)

                          + items {
                              + mode = (known after apply)
                              + path = (known after apply)

                              + field_ref {
                                  + api_version = (known after apply)
                                  + field_path  = (known after apply)
                                }

                              + resource_field_ref {
                                  + container_name = (known after apply)
                                  + quantity       = (known after apply)
                                  + resource       = (known after apply)
                                }
                            }
                        }

                      + empty_dir {
                          + medium = (known after apply)
                        }

                      + fc {
                          + fs_type      = (known after apply)
                          + lun          = (known after apply)
                          + read_only    = (known after apply)
                          + target_ww_ns = (known after apply)
                        }

                      + flex_volume {
                          + driver    = (known after apply)
                          + fs_type   = (known after apply)
                          + options   = (known after apply)
                          + read_only = (known after apply)

                          + secret_ref {
                              + name = (known after apply)
                            }
                        }

                      + flocker {
                          + dataset_name = (known after apply)
                          + dataset_uuid = (known after apply)
                        }

                      + gce_persistent_disk {
                          + fs_type   = (known after apply)
                          + partition = (known after apply)
                          + pd_name   = (known after apply)
                          + read_only = (known after apply)
                        }

                      + git_repo {
                          + directory  = (known after apply)
                          + repository = (known after apply)
                          + revision   = (known after apply)
                        }

                      + glusterfs {
                          + endpoints_name = (known after apply)
                          + path           = (known after apply)
                          + read_only      = (known after apply)
                        }

                      + host_path {
                          + path = (known after apply)
                          + type = (known after apply)
                        }

                      + iscsi {
                          + fs_type         = (known after apply)
                          + iqn             = (known after apply)
                          + iscsi_interface = (known after apply)
                          + lun             = (known after apply)
                          + read_only       = (known after apply)
                          + target_portal   = (known after apply)
                        }

                      + local {
                          + path = (known after apply)
                        }

                      + nfs {
                          + path      = (known after apply)
                          + read_only = (known after apply)
                          + server    = (known after apply)
                        }

                      + persistent_volume_claim {
                          + claim_name = (known after apply)
                          + read_only  = (known after apply)
                        }

                      + photon_persistent_disk {
                          + fs_type = (known after apply)
                          + pd_id   = (known after apply)
                        }

                      + quobyte {
                          + group     = (known after apply)
                          + read_only = (known after apply)
                          + registry  = (known after apply)
                          + user      = (known after apply)
                          + volume    = (known after apply)
                        }

                      + rbd {
                          + ceph_monitors = (known after apply)
                          + fs_type       = (known after apply)
                          + keyring       = (known after apply)
                          + rados_user    = (known after apply)
                          + rbd_image     = (known after apply)
                          + rbd_pool      = (known after apply)
                          + read_only     = (known after apply)

                          + secret_ref {
                              + name = (known after apply)
                            }
                        }

                      + secret {
                          + default_mode = (known after apply)
                          + optional     = (known after apply)
                          + secret_name  = (known after apply)

                          + items {
                              + key  = (known after apply)
                              + mode = (known after apply)
                              + path = (known after apply)
                            }
                        }

                      + vsphere_volume {
                          + fs_type     = (known after apply)
                          + volume_path = (known after apply)
                        }
                    }
                }
            }

          + volume_claim_template {
              + metadata {
                  + generation       = (known after apply)
                  + name             = "data"
                  + namespace        = "default"
                  + resource_version = (known after apply)
                  + self_link        = (known after apply)
                  + uid              = (known after apply)
                }

              + spec {
                  + access_modes       = [
                      + "ReadWriteOnce",
                    ]
                  + storage_class_name = "standard"
                  + volume_name        = (known after apply)

                  + resources {
                      + requests = {
                          + "storage" = "5Gi"
                        }
                    }
                }
            }
        }
    }

Plan: 9 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform1`, Action: `hashicorpterraform-github-actions3`*